# Simple, modern, secure file encryption
brew "age"
# List ASCII idiomatic names and octal/decimal code-point forms
brew "ascii"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Official Amazon AWS command-line interface
brew "awscli"
# Text-based UI library
brew "ncurses"
# Google's own build tool
brew "bazel"
# Collection of portable C++ source libraries
brew "boost"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Unit testing framework for C++
brew "cppunit"
# High performance csv viewer for cli
brew "csview"
# Command-line csv viewer
brew "csvlens"
# File comparison utilities
brew "diffutils"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# GNU database manager
brew "gdbm"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Git Remote Helper to interact with AWS CodeCommit
brew "git-remote-codecommit"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library access to GnuPG
brew "gpgme"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Java-based scripting language
brew "groovy"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# International Ispell
brew "ispell"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Input filter for the pager less
brew "lesspipe"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Rotates, compresses, and mails system logs
brew "logrotate"
# Text-based web browser
brew "lynx"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils", link: false
# Run multiple commands in parallel
brew "mprocs"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Shell command parallelization utility
brew "parallel"
# Generate Postscript calendars without X
brew "pcal"
# Package management made easy
brew "pixi"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Software environment for statistical computing
brew "r"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Autoformat shell script source code
brew "shfmt"
# Work with remote images registries
brew "skopeo"
# Source-code syntax highlighter
brew "source-highlight"
# Soak up standard input and write to a file
brew "sponge"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Backup/restore tool
cask "kopiaui"
npm "@aws-amplify/cli"
npm "@aws-sdk/client-lambda"
npm "aws-sdk"
npm "diff-so-fancy"
