# Simple, modern, secure file encryption
brew "age"
# Text-based UI library
brew "ncurses"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Google's own build tool
brew "bazel"
# Collection of portable C++ source libraries
brew "boost"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Unit testing framework for C++
brew "cppunit"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU database manager
brew "gdbm"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Java-based scripting language
brew "groovy"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# International Ispell
brew "ispell"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Input filter for the pager less
brew "lesspipe"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Rotates, compresses, and mails system logs
brew "logrotate"
# Text-based web browser
brew "lynx"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Command-line interface for SQLite
brew "sqlite"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Generate Postscript calendars without X
brew "pcal"
# Package management made easy
brew "pixi"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Software environment for statistical computing
brew "r"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Autoformat shell script source code
brew "shfmt"
# Source-code syntax highlighter
brew "source-highlight"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
npm "diff-so-fancy"
